'''2.5. Знаменитая цитата: найдите известное высказывание, которое вам 
понравилось. Выведите текст цитаты с именем автора. 
Результат должен выглядеть примерно так (включая кавычки):
Albert Einstein once said, "A person who never made
a mistake never tried anything new." '''

'''2.6. Знаменитая цитата 2: повторите упражнение 2.5, но на этот раз 
сохраните имя автора цитаты в переменной famous_person. 
Затем составьте сообщение и сохраните его в новой
переменной с именем message. Выведите свое сообщение.'''

famous_person = 'Хилон из Спарты'
message = f'{famous_person} однажды сказал: "О мёртвых либо хорошо, либо ничего, кроме правды"'
print(message)