'''2.8. Число 8: напишите операции сложения, вычитания, умножения и деления,
результатом которых является число 8. Не забудьте заключить операции в команды 
print(), чтобы проверить результат. Вы должны написать четыре строки кода'''

print(4 + 4)
print(32 - 24)
print(2*4)
print(int(64/8))

'''2.9. Любимое число: сохраните свое любимое число в переменной.
Затем при помощи переменной создайте сообщение для вывода этого числа.
Выведите это сообщение.'''

bestnum = 365
numinfo = f'\nMy favorite number is {bestnum}'
print(numinfo)

# 2.10. Добавление комментариев: выберите две программы из написанных вами и 
# добавьте в каждую хотя бы один комментарий. Если вы не найдете, что написать 
# в комментариях, потому что программы были слишком просты, добавьте свое имя
#  и текущую дату в начало кода. Затем добавьте одно предложение с описанием 
# того, что делает программа.